# 两种注释的表达
# 这是单行注释

'''
这是
多行注释
用三个引号开始和结束
'''

# 字典，可以储存任意数量的信息{}
ken = {'流浪者':'风散','神之眼':'风系'}
print(ken['流浪者'])
print(ken['神之眼'])
me = ken['流浪者']
print('我最爱的是'+me+'！')
# 在字典中添加：键——值对
ken['性格'] = '傲娇'
ken['性别'] = '男'
print(ken)
# 更改字典：键中的值
ken['性格'] = '毒舌'
print(ken)

# 手动十进制转为二进制编码
"""
31
15:1,7:1,3:1,1:1,0:1
(31) 10 = (11111) 2
"""
# 使用函数bin转换
print(bin(31))
# 手动二进制转为十进制编码
"""
101110
0+2+4+8+0+32=46
(101110) 2 = (46) 10
"""
# 使用函数int转换
print(int('0b101110',2))