## 学习
# 1.用range()函数创建有序数字列表（实际要+1或-1）
for value in range(1,6):
	print(value)
	
# 2.range()函数（最小值，最大值，每次增加的值）
n = list(range(7,19,3))
print(n)

# 3.用**打印数值的平方
a = []
for u in range(1,11):
	a.append(u**2) # 循环的内容
print(a)
print(min(a)) # 最小值
print(max(a)) # 最大值
print(sum(a)) # 总和

## 应用
print('历历万乡\n')
b = ['他住在七月的洪流上\n','天台倾倒一万仗，\n','他睡在北风仓皇途径的芦苇荡，\n','他梦中的草原白茫茫，\n','夜色搭上悲欢去辗转，\n','他尝遍了每个异乡限时赠送的糖，\n','若我站在朝阳上，\n','能否脱去昨日的惆怅，\n','单薄语言能否传达我所有的牵挂，\n','有天我不复勇往能否坚持走完这一场，\n','踏遍万水千山只剩一地故乡，\n','城市慷慨亮整夜光，\n','如同少年不惧岁月长，\n','他想要的不多只是和别人的不一样，\n','烛光倒影为我添茶，\n','相逢太短不等茶水凉，\n','你留下的习惯还顽强活在我身上，\n','若我站在朝阳上，\n','能否脱去昨日的惆怅，\n','单薄语言能否传达我所有的牵挂，\n','若我有天不负勇往，\n','能否坚持走完这一场？']
for v in b:
	print('散兵'+v+'\n'+'共20')

w = ['木子','露露','与鹤','清尘']
for happy in w:
	print(happy+'你好吗？')
for q in range(5,10):
	print(q)
