"""
 print(100 - 25 * 3 % 4) 应该输出什么? （B ）

A. 1

B. 97

C. 25

D. 0

下列哪种说法是错误的（A ）。

A. 除字典类型外，所有标准对象均可以⽤于布尔测试

B. 空字符串的布尔值是False

C. 空列表对象的布尔值是False

D. 值为0的任何数字对象的布尔值是False

下列表达式的值为True的是（B ）。

A. 3>2>2

B. 1 and 2 != 1

C. not(11 and 0 != 2)

D. 10 < 20 and 10 < 5

Python不⽀持的数据类型有（A ）。

A. char

B. int

C. float

D. list

（多选）n = 6784，以下能够获取到7 的⽅法有（C,D）。

A. n / 1000 % 100

B. n % 1000 / 100

C. n // 100 % 10

D. n // 10 % 100 // 10

运⾏以下程序，当从键盘上输⼊12,运⾏结果是（A ）。

x = (input())
print(type(x))
1
2
A. <class 'str'>

B. <class 'int'>

C. 出错

D. <class 'dict'>

下列表达式的运算结果是(  ) 。

a = 100
b = False
print(a * b > -1)
1
2
3
A. False

B. 1

C. 0

D. True

填空题
查看变量中数据的类型的函数名是（ ）。
已知 x = 3 == 3 ,执⾏结束后，变量x的值为（ ）。
已知 x = 3 ，那么执⾏语句 x += 6 之后，x的值为（ ）。
表达式 3 ** 2 的值为（ ）,表达式 3 * 2 的值为（ ），表达式 4 ** 0.5 的值为（ ）。
编程题
写出判断⼀个数是否能同时被2和5整除的条件语句, 并且打印对应的结果。


写出判断⼀个数是否能够被2或者5整除，但是不能同时被2或者5整除的条件语句， 并且打印对应

的结果。


假设今天的上课时间为15678秒，编程计算今天上课时间是多少⼩时，多少分钟，多少秒；以‘XX

时XX分XX秒’的⽅式表示出来。

例如：100秒表示成 0时1分40秒


定义两个变量保存⼀个⼈的身⾼和体重，编程实现判断这个⼈的身材是否正常!

公式: 体重(kg)/身⾼(m)的平⽅值 在18.5 ~ 24.9之间属于正常。

输出格式： 是否正常：True/False
 """

